---
kind: method
id: M:Autodesk.Revit.DB.DirectShapeLibrary.GetDirectShapeLibrary(Autodesk.Revit.DB.Document)
source: html/a9b9ac8d-1a11-c5b3-f073-bb52eb6212d9.htm
---
# Autodesk.Revit.DB.DirectShapeLibrary.GetDirectShapeLibrary Method

Get the currently active Library object

## Syntax (C#)
```csharp
public static DirectShapeLibrary GetDirectShapeLibrary(
	Document ADoc
)
```

## Parameters
- **ADoc** (`Autodesk.Revit.DB.Document`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null